# -*- coding:utf-8 -*-
noun = ['環境衛生設備', '大眾運輸工具', '停車場氣味', '食品選擇性', '保養狀況', '一家大小', '龍舟比賽', '等待時間', '歷史背景', '硬體設備', '遊樂設施', '商城佈置', '購物中心', '全家大小', '攜家帶眷', '親水設施', '美食餐廳', '飲食種類', '餐廳選擇', '觀景台', '便當店', '棒球場', '戲劇院', '歌劇院', '單車道', '垃圾桶', '哺乳室', '洗手間', '遊戲區', '遊樂區', '溜冰場', '小木屋', '櫻花樹', '噴水池', '手扶梯', '動物園', '戲水區', '停車場', '選擇性', '美食街', '腳踏車', '自行車', '溜滑梯', '停車位', '整修', '門票', '態度', '交通', '小吃', '遮避', '燈塔', '風車', '人潮', '地方', '台鐵', '高鐵', '座位', '規模', '溫泉', '纜車', '沙雕', '寺廟', '路燈', '座椅', '冷氣', '空調', '氣味', '垃圾', '山路', '空氣', '登山', '綠地', '陰影', '河堤', '土質', '池塘', '草地', '風景', '夜景', '景觀', '太陽', '環境', '景象', '景色', '品牌', '電梯', '裝飾', '商店', '禮品', '購物', '價格', '收費', '動線',
        '服務', '標示', '指示', '規劃', '管理', '遊客', '遊民', '親子', '小孩', '野餐', '郊遊', '休息', '攝影', '拍照', '動物', '海邊', '海岸', '戲水', '沙灘', '海灘', '作品', '玩水', '雕塑', '模型', '展品', '館藏', '藝術', '會車', '動向', '路線', '車位', '停車', '捷運', '火車', '餐點', '夜市', '美食', '咖啡', '便當', '晚餐', '午餐', '人員', '小吃', '廁所', '公園', '湖景', '夕陽', '逛街', '步道', '廟', '人']
a = sorted(noun,key=len)
a.reverse()
print(a)

classification = ["多的","少的","大的","小的","便宜的","免費的","昂貴的","美麗的","不好看的","好吃的","難吃的","值得一看的","無趣的","熱的","寒冷的","乾淨的","髒亂的","方便的","不方便的","不足的","態度優良的","態度不佳的","遙遠的","推薦前往的","難找的","擁擠的","寧靜的","熱鬧的","舒適的","不清楚的","評價好的","不推薦的","好評的"]

# with open('combine.txt', 'w') as f:
#         for each in noun:
#                 for conclusion in classification:
#                         item = each + conclusion
#                         f.write("%s\n" % item)


# adj = ['多', '少', '大', '小', '貴', '美', '醜', '曬', '熱', '冷', '寒', '凍', '亂', '髒', '兇', '擠', '酷', '爛', '醜', '低', '久', '慢', '許多', '很多', '超多', '蠻多', '較少', '很少', '蠻少', '超少', '很大', '超大', '巨大', '窄小', '很小', '蠻小', '親民', '合理', '低廉', '平價', '實惠', '便宜', '免費', '很貴', '超貴', '蠻貴', '好美', '難看', '好吃', '精緻', '難吃', '不錯', '創意', '很棒', '驚喜', '用心', '豐富', '優秀', '細膩', '有趣', '厲害', '精美', '無趣', '無聊', '乾淨', '整潔', '骯髒', '便利', '不錯', '塞車', '傲慢', '遙遠', '壯觀', '震撼', '厲害', '佩服', '讚嘆', '車多', '擁擠', '平靜', '熱鬧', '舒適', '舒服', '優美', '寬敞', '明亮', '新鮮', '不易', '錯誤', '失望', '複雜',
#        '值得', '適合', '推薦', '好玩', '喜歡', '開心', '推薦', '齊全', '良好', '糟糕', '不推', '差勁', '掃興', '危險', '害怕', '詭異', '不易', '不便', '和善', '非常多', '多到爆', '有點多', '非常少', '有點少', '蠻大的', '小點小', '蠻小的', '有點小', '很實惠', '不用錢', '不便宜', '蠻貴的', '漂亮的', '美麗的', '種類多', '不好吃', '不乾淨', '超方便', '不方便', '沒耐性', '更舒服', '不清楚', '差太多', '特別好', '最棒的', '不值得', '沒品質', '不建議', '不理想', '再加強', '態度好', '有禮貌', '有耐心', '沒禮貌', '態度差', '沒有很多', '印象深刻', '鬼斧神工', '栩栩如生', '印象深刻', '相當不便', '路途遙遠', '嘆為觀止', '鬼斧神工', '印象深刻', '鬼斧神工', '非常難找', '不夠簡單', '不夠清楚', '非常不好', '態度很好', '態度很差', '一位難求''不是特別好', '不太足夠用心']
